{
  "version": "v1.0.0",
  "date": "2026-02-18 17:21:39 -0500",
  "commitHash": "9c7939ab",
  "summary": "Grove v1.0 brings the foundational Loom and Threshold SDKs, unlocking powerful new capabilities like unified rate limiting and server-synced auto-save. The release introduces the Vista observability dashboard for deeper insights, expands Meadow with a community feed and social features, and delivers a host of refinements from image handling to navigation guards. This milestone solidifies the platform's core architecture, making Grove more reliable, social, and ready to grow.\n",
  "stats": {
    "totalCommits": 386,
    "features": 103,
    "fixes": 173,
    "refactoring": 15,
    "docs": 62,
    "tests": 3,
    "performance": 2
  },
  "highlights": {
    "features": [
  "rename @autumnsgrove/groveengine to @autumnsgrove/lattice",
  "add Vista observability dashboard and collection infrastructure (#1160)",
  "wire --comments flags and add issue comments command",
  "migrate magic link emails from direct Resend to Zephyr (#1159)",
  "migrate Google OAuth and magic link to server-side form actions (#1158)",
  "merge support into contribute, redirect /support to /porch, wire footer (#1157)",
  "group workflow runs by commit in `gw gh run list`",
  "add raven-investigate skill — cross-codebase security detective (#1146)",
  "add two-level opt-in control for community feed",
  "community feed with social features (#1141)"
],
    "fixes": [
  "add explicit exports entry for server/observability",
  "rename remaining groveengine refs from post-rebase sync",
  "revert zephyr vitest bump and fix skill filename casing",
  "rename remaining groveengine refs missed in initial pass",
  "remove case-duplicate skill.md ghost from npm-publish",
  "resolve all ESLint errors from toolchain rollout",
  "correct TenantDO D1 column names",
  "sync profile photo to nav bar avatar",
  "restore dark mode across roadmap, credits, forest, and remaining pages (#1155)",
  "build engine before durable-objects type check"
]
  }
}
