{
  "version": "v1.1.0",
  "date": "2026-02-26 20:58:36 -0500",
  "commitHash": "efca8ecf",
  "summary": "Grove v1.1.0 brings powerful new tools for creators and developers! This release introduces the Glimpse rewrite for smarter content suggestions, universal Shelves to beautifully organize links, and the Amber SDK for unified storage. We've also made significant improvements to mobile layouts, authentication, and our underlying infrastructure while expanding our documentation with deep dives and safari journals. It's all about giving you more control, better performance, and a smoother editing experience across your sites.\n",
  "stats": {
    "totalCommits": 340,
    "features": 80,
    "fixes": 124,
    "refactoring": 24,
    "docs": 79,
    "tests": 6,
    "performance": 3
  },
  "highlights": {
    "features": [
  "complete rewrite — all 7 phases implemented (#1269)",
  "migrate timeline-sync and lumen to Infra SDK (Phase 3)",
  "add ephemeral dev environments on Fly.io",
  "add Firefly SDK for ephemeral server provisioning",
  "migrate warden to Infra SDK",
  "migrate email-catchup to Infra SDK",
  "migrate meadow-poller to Infra SDK",
  "rename server-sdk, partial context, framework middleware, first consumer (#1260)",
  "implement Amber SDK unified storage management (#1243)",
  "add Aquifer schema, parallel GET, onMount cleanup"
],
    "fixes": [
  "move auto-formatting from edit-time to commit-time (#1276)",
  "constrain content width on mobile viewports — Fixes #1250 (#1274)",
  "display name fallback instead of Wanderer — Fixes #1251 (#1272)",
  "replace old asterisk SVG logo with hosted PNG across all templates",
  "add foliage, vineyard, email-catchup to CI typecheck matrix",
  "resolve foliage type errors and vineyard build/lint issues",
  "resolve all svelte-check warnings across engine",
  "resolve type errors in palette and API routes",
  "collapse umbrella dirs into single grove islands",
  "correct import.meta.glob path so grove census data loads"
]
  }
}
